CSI API ETABS v1
cDCoACI318_14 Interface
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
public interface cDCoACI318_14
Public Interface cDCoACI318_14
Dim instance As cDCoACI318_14
public interface class cDCoACI318_14
type cDCoACI318_14 =  interface end
The cDCoACI318_14 type exposes the following members.
Methods
Name | Description
GetOverwrite
 Retrieves the value of a concrete design overwrite item.
GetPreference
 Retrieves the value of a concrete design preference item.
SetOverwrite
 Sets the value of a concrete design overwrite item.
SetPreference
 Sets the value of a concrete design preference item.
Top
See Also
Reference
ETABSv1 Namespace